ExponentialDeepSpace/KiCon2023Asia-Badge/fw/svd/N32L406_with_core.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device
    schemaVersion="1.3"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
    xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>Nationstech Ltd.</vendor>
    <vendorID>NS</vendorID>
    <name>N32L406</name>
    <version>1.0</version>
    <description>N32L406</description>

    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0</resetValue>
    <resetMask>0xffffffff</resetMask>
    <peripherals>
    <peripheral>
        <name>Control</name>
        <description>System Control registers</description>
        <baseAddress>0xe000e008</baseAddress>
        <addressBlock><offset>0x00000000</offset><size>0x00000004</size><usage>registers</usage></addressBlock>
        <addressBlock><offset>0x00000cfc</offset><size>0x0000003c</size><usage>registers</usage></addressBlock>
        <addressBlock><offset>0x00000d80</offset><size>0x00000004</size><usage>registers</usage></addressBlock>
        <addressBlock><offset>0x00000df4</offset><size>0x00000004</size><usage>registers</usage></addressBlock>
        <addressBlock><offset>0x00000ef8</offset><size>0x00000004</size><usage>registers</usage></addressBlock>
        <registers>
        <register>
            <name>ACTLR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Disables certain aspects of functionality within the processor</description>
            <fields>
            <field>
                <name>DISOOFP</name>
                <description>Disables floating point instructions completing out of order with respect to integer instructions</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>ENABLED_DISABLED</name>
                <headerEnumName>ENABLED_DISABLED</headerEnumName>
                <enumeratedValue><name>Enabled</name><description>Enabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Disabled</name><description>Disabled</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>DISFPCA</name>
                <description>Disable automatic update of CONTROL.FPCA</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ENABLED_DISABLED"/>
            </field>
            <field>
                <name>DISFOLD</name>
                <description>Disables folding of IT instructions</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ENABLED_DISABLED"/>
            </field>
            <field>
                <name>DISDEFWBUF</name>
                <description>Disables write buffer use during default memory map accesses</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ENABLED_DISABLED"/>
            </field>
            <field>
                <name>DISMCYCINT</name>
                <description>Disables interruption of multi-cycle instructions</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ENABLED_DISABLED"/>
            </field>
            </fields>
            <addressOffset>0x0</addressOffset>
            <addressOffset>0x0</addressOffset>
        </register>
        <register>
            <name>ICSR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Provides software control of the NMI, PendSV, and SysTick exceptions, and provides interrupt status information</description>
            <fields>
            <field>
                <name>NMIPENDSET</name>
                <description>Activates an NMI exception or reads back the current state</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>ICSR_NMIPENDSET</name>
                <headerEnumName>ICSR_NMIPENDSET</headerEnumName>
                <enumeratedValue><name>Do_not_activate</name><description>Do not activate</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Activate_NMI_exception</name><description>Activate NMI exception</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>PENDSVSET</name>
                <description>Sets a pending PendSV interrupt or reads back the current state</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>ICSR_PENDSET</name>
                <headerEnumName>ICSR_PENDSET</headerEnumName>
                <enumeratedValue><name>Do_not_set</name><description>Do not set</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Set_pending</name><description>Set pending</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>PENDSVCLR</name>
                <description>Clears a pending PendSV interrupt</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>ICSR_PENDCLR</name>
                <headerEnumName>ICSR_PENDCLR</headerEnumName>
                <enumeratedValue><name>Do_not_clear</name><description>Do not clear</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear_pending</name><description>Clear pending</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>PENDSTSET</name>
                <description>Sets a pending SysTick or reads back the current state</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ICSR_PENDSET"/>
            </field>
            <field>
                <name>PENDSTCLR</name>
                <description>Clears a pending SysTick, whether set here or by the timer hardware</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ICSR_PENDCLR"/>
            </field>
            <field>
                <name>ISRPREEMPT</name>
                <description>Indicates whether a pending exception will be serviced on exit from debug halt state</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>ICSR_PREEMPT</name>
                <headerEnumName>ICSR_PREEMPT</headerEnumName>
                <enumeratedValue><name>Will_not_service</name><description>Will not service</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Will_service_pending_exception</name><description>Will service pending exception</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>ISRPENDING</name>
                <description>Indicates if an external configurable, NVIC generated, interrupt is pending</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>ICSR_PENDING</name>
                <headerEnumName>ICSR_PENDING</headerEnumName>
                <enumeratedValue><name>Interrupt_not_pending</name><description>Interrupt not pending</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Interrupt_pending</name><description>Interrupt pending</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>VECTPENDING</name>
                <description>The exception number for the highest priority pending exception. 0 indicates no pending exceptions</description>
                <bitRange>[20:12]</bitRange>
            </field>
            <field>
                <name>RETTOBASE</name>
                <description>In Handler mode, indicates whether there is an active exception other than the exception indicated by the current value of the IPSR</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>ICSR_RETTOBASE</name>
                <headerEnumName>ICSR_RETTOBASE</headerEnumName>
                <enumeratedValue><name>Active_exception</name><description>Active exception</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>No_Active_Exception</name><description>No Active Exception</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>VECTACTIVE</name>
                <description>The exception number for the current executing exception</description>
                <bitRange>[8:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x3324</addressOffset>
            <addressOffset>0xcfc</addressOffset>
        </register>
        <register>
            <name>VTOR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Holds the vector table address</description>
            <fields>
            <field>
                <name>TBLOFF</name>
                <description>Bits [31:7] of the vector table address</description>
                <bitRange>[31:7]</bitRange>
            </field>
            <field>
                <name>TBLBASE</name>
                <description>Determines whether the vector table is in the code or SRAM memory region</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>VTOR_TBLBASE</name>
                <headerEnumName>VTOR_TBLBASE</headerEnumName>
                <enumeratedValue><name>CODE</name><description>CODE</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>SRAM</name><description>SRAM</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            </fields>
            <addressOffset>0x3328</addressOffset>
            <addressOffset>0xd00</addressOffset>
        </register>
        <register>
            <name>DEMCR</name>
            <size>32</size>
            <access>read-only</access>
            <description>Manages vector catch behaviour and DebugMonitor handling when debugging</description>
            <fields>
            <field>
                <name>MON_EN</name>
                <description>Enable the DebugMonitor exception</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>MON_PEND</name>
                <description>Sets or clears the pending state of the DebugMonitor exception</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            </fields>
            <addressOffset>0x3572</addressOffset>
            <addressOffset>0xdf4</addressOffset>
        </register>
        <register>
            <name>AIRCR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or returns interrupt control data</description>
            <fields>
            <field>
                <name>VECTKEY</name>
                <description>Vector Key</description>
                <bitRange>[31:16]</bitRange>
            </field>
            <field>
                <name>VECTKEYSTAT</name>
                <description>UNKNOWN</description>
                <bitRange>[31:16]</bitRange>
            </field>
            <field>
                <name>ENDIANNESS</name>
                <description>Indicates the memory system data endianness</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>AIRCR_ENDIANNESS</name>
                <headerEnumName>AIRCR_ENDIANNESS</headerEnumName>
                <enumeratedValue><name>Little_endian</name><description>Little endian</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Big_endian</name><description>Big endian</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>PRIGROUP</name>
                <description>Priority grouping, indicates the    binary point position.</description>
                <bitRange>[10:8]</bitRange>
            </field>
            <field>
                <name>SYSRESETREQ</name>
                <description>System Reset Request</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>AIRCR_RESETREQ</name>
                <headerEnumName>AIRCR_RESETREQ</headerEnumName>
                <enumeratedValue><name>Do_not_request_reset</name><description>Do not request reset</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Request_reset</name><description>Request reset</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>VECTCLRACTIVE</name>
                <description>Clears all active state information for fixed and configurable exceptions</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>AIRCR_VECTCLR</name>
                <headerEnumName>AIRCR_VECTCLR</headerEnumName>
                <enumeratedValue><name>Do_not_clear</name><description>Do not clear</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear_state_information</name><description>Clear state information</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            </fields>
            <addressOffset>0x3332</addressOffset>
            <addressOffset>0xd04</addressOffset>
        </register>
        <register>
            <name>SCR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or returns system control data</description>
            <fields>
            <field>
                <name>SEVONPEND</name>
                <description>Determines whether an interrupt transition from inactive state to pending state is a wakeup event</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>SCR_SEVONPEND</name>
                <headerEnumName>SCR_SEVONPEND</headerEnumName>
                <enumeratedValue><name>Not_wakeup</name><description>Not wakeup</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Wakeup</name><description>Wakeup</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>SLEEPDEEP</name>
                <description>Hint indicating that waking from sleep might take longer</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>SCR_SLEEPDEEP</name>
                <headerEnumName>SCR_SLEEPDEEP</headerEnumName>
                <enumeratedValue><name>Not_deep_sleep</name><description>Not deep sleep</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Deep_sleep</name><description>Deep sleep</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>SLEEPONEXIT</name>
                <description>whether, on an exit from an ISR that returns to the base level of execution priority, the processor enters a sleep state</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>SCR_SLEEPONEXIT</name>
                <headerEnumName>SCR_SLEEPONEXIT</headerEnumName>
                <enumeratedValue><name>Do_not_enter</name><description>Do not enter</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enter</name><description>Enter</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            </fields>
            <addressOffset>0x3336</addressOffset>
            <addressOffset>0xd08</addressOffset>
        </register>
        <register>
            <name>CCR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Configuration and Control</description>
            <fields>
            <field>
                <name>STKALIGN</name>
                <description>Determines whether the exception entry sequence guarantees 8-byte stack frame alignment, adjusting the SP if necessary before saving state</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>CCR_STKALIGN</name>
                <headerEnumName>CCR_STKALIGN</headerEnumName>
                <enumeratedValue><name>_4_Byte</name><description> 4 Byte</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>_8_Byte</name><description> 8 Byte</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>BFHFNMIGN</name>
                <description>Determines the effect of precise data access faults on handlers running at priority -1 or priority -2</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>CCR_BFHFNMIGN</name>
                <headerEnumName>CCR_BFHFNMIGN</headerEnumName>
                <enumeratedValue><name>Fault</name><description>Fault</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Ignore</name><description>Ignore</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>DIV_0_TRP</name>
                <description>Controls the trap on divide by 0</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>DISABLED_ENABLED</name>
                <headerEnumName>DISABLED_ENABLED</headerEnumName>
                <enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>UNALIGN_TRP</name>
                <description>Controls the trapping of unaligned word or halfword accesses</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="DISABLED_ENABLED"/>
            </field>
            <field>
                <name>USERSETMPEND</name>
                <description>Controls whether unprivileged software can access the STIR</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="DISABLED_ENABLED"/>
            </field>
            <field>
                <name>NONBASETHRDENA</name>
                <description>Controls whether the processor can enter Thread mode at an execution priority level other than base level</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="DISABLED_ENABLED"/>
            </field>
            </fields>
            <addressOffset>0x3340</addressOffset>
            <addressOffset>0xd0c</addressOffset>
        </register>
        <register>
            <name>SHPR1</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or returns priority for system handlers 4-7</description>
            <fields>
            <field>
                <name>PRI_7</name>
                <description>Priority of system handler 7</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_6</name>
                <description>Priority of system handler 6, UsageFault</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_5</name>
                <description>Priority of system handler 5, BusFault</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_4</name>
                <description>Priority of system handler 4, MemManage</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x3344</addressOffset>
            <addressOffset>0xd10</addressOffset>
        </register>
        <register>
            <name>SHPR2</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or returns priority for system handlers 8-11</description>
            <fields>
            <field>
                <name>PRI_11</name>
                <description>Priority of system handler 11, SVCall</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_10</name>
                <description>Priority of system handler 10</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_9</name>
                <description>Priority of system handler 9</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_8</name>
                <description>Priority of system handler 8</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x3348</addressOffset>
            <addressOffset>0xd14</addressOffset>
        </register>
