ExponentialDeepSpace/KiCon2023Asia-Badge/fw/svd/N32L406_with_core.svd
        <register>
            <name>SHPR3</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or returns priority for system handlers 12-15</description>
            <fields>
            <field>
                <name>PRI_15</name>
                <description>Priority of system handler 15, SysTick</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_14</name>
                <description>Priority of system handler 14, PendSV</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_13</name>
                <description>Priority of system handler 13</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_12</name>
                <description>Priority of system handler 4, DebugMonitor</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x3352</addressOffset>
            <addressOffset>0xd18</addressOffset>
        </register>
        <register>
            <name>SHCSR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Controls and provides the active and pending status of system exceptions</description>
            <fields>
            <field>
                <name>USGFAULTENA</name>
                <description>Enable UsageFault</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="DISABLED_ENABLED"/>
            </field>
            <field>
                <name>BUSFAULTENA</name>
                <description>Enable BusFault</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="DISABLED_ENABLED"/>
            </field>
            <field>
                <name>MEMFAULTENA</name>
                <description>Enable MemManage fault</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="DISABLED_ENABLED"/>
            </field>
            <field>
                <name>SVCALLPENDED</name>
                <description>SVCall pending</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>PENDING</name>
                <headerEnumName>PENDING</headerEnumName>
                <enumeratedValue><name>Not_pending</name><description>Not pending</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Pending</name><description>Pending</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>BUSFAULTPENDED</name>
                <description>BusFault pending</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="PENDING"/>
            </field>
            <field>
                <name>MEMFAULTPENDED</name>
                <description>MemManage pending</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="PENDING"/>
            </field>
            <field>
                <name>USGFAULTPENDED</name>
                <description>UsageFault pending</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="PENDING"/>
            </field>
            <field>
                <name>SYSTICKACT</name>
                <description>SysTick active</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>ACTIVE</name>
                <headerEnumName>ACTIVE</headerEnumName>
                <enumeratedValue><name>Not_active</name><description>Not active</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Active</name><description>Active</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>PENDSVACT</name>
                <description>PendSV active</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ACTIVE"/>
            </field>
            <field>
                <name>MONITORACT</name>
                <description>Monitor active</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ACTIVE"/>
            </field>
            <field>
                <name>SVCALLACT</name>
                <description>SVCall active</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ACTIVE"/>
            </field>
            <field>
                <name>USGFAULTACT</name>
                <description>UsageFault active</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ACTIVE"/>
            </field>
            <field>
                <name>BUSFAULTACT</name>
                <description>BusFault active</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ACTIVE"/>
            </field>
            <field>
                <name>MEMFAULTACT</name>
                <description>MemManage active</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="ACTIVE"/>
            </field>
            </fields>
            <addressOffset>0x3356</addressOffset>
            <addressOffset>0xd1c</addressOffset>
        </register>
        <register>
            <name>CFSR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Contains the three Configurable Fault Status Registers MMFSR, BFSR, UFSR</description>
            <fields>
            <field>
                <name>DIVBYZERO</name>
                <description>Divide by zero error</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>OCCURRED</name>
                <headerEnumName>OCCURRED</headerEnumName>
                <enumeratedValue><name>Not_occurred</name><description>Not occurred</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Occurred</name><description>Occurred</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>UNALIGNED</name>
                <description>Unaligned access error</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>NOCP</name>
                <description>Coprocessor access error</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>INVPC</name>
                <description>Integrity check error on EXC_RETURN</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>INVSTATE</name>
                <description>Instruction executed with invalid EPSR.T or EPSR.IT field</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>UNDEFINSTR</name>
                <description>Processor has attempted to execute an undefined instruction.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>BFARVALID</name>
                <description>BFAR has valid contents</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>VALID</name>
                <headerEnumName>VALID</headerEnumName>
                <enumeratedValue><name>Not_valid</name><description>Not valid</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Valid</name><description>Valid</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>LSPERR</name>
                <description>Bus fault during FP lazy state preservation</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>STKERR</name>
                <description>Derived bus fault on exception entry</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>UNSTKERR</name>
                <description>Derived bus fault on exception return</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>IMPRECISERR</name>
                <description>Imprecise data access error</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>PRECISERR</name>
                <description>Precise data access error</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>IBUSERR</name>
                <description>Bus fault on an instruction prefetch</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>MMARVALID</name>
                <description>MMAR has valid contents</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="VALID"/>
            </field>
            <field>
                <name>MLSPERR</name>
                <description>MemManage fault during FP lazy state preservation</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>MSTKERR</name>
                <description>Derived MemManage fault on exception entry</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>MUNSTKERR</name>
                <description>Derived MemManage fault on exception return</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>DACCVIOL</name>
                <description>Data access violation. The MMAR shows the data address that the load or store tried to access</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>IACCVIOL</name>
                <description>MPU or Execute Never (XN) default memory map access violation on an instruction fetch</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            </fields>
            <addressOffset>0x3360</addressOffset>
            <addressOffset>0xd20</addressOffset>
        </register>
        <register>
            <name>HFSR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Shows the cause of any hard faults</description>
            <fields>
            <field>
                <name>DEBUGEVT</name>
                <description>Indicates a Debug event has occurred</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>FORCED</name>
                <description>Indicates a fault with configurable priority has been escalated to a HardFault</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            <field>
                <name>VECTTBL</name>
                <description>Indicates a fault has occurred because of a vector table read error on exception processing</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="OCCURRED"/>
            </field>
            </fields>
            <addressOffset>0x3364</addressOffset>
            <addressOffset>0xd24</addressOffset>
        </register>
        <register>
            <name>DFSR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Shows, at the top level, why a debug event occurred</description>
            <fields>
            <field>
                <name>EXTERNAL</name>
                <description>Indicates a debug event generated because of the assertion of EDBGRQ</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>VCATCH</name>
                <description>Indicates triggering of a Vector catch</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>DWTTRAP</name>
                <description>Indicates a debug event generated by the DWT</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>BKPT</name>
                <description>Indicates a debug event generated by BKPT instruction execution or a breakpoint match in FPB</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>HALTED</name>
                <description>Indicates a debug event generated by C_HALT or C_STEP request or setting DEMCR.MON_STEP</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            </fields>
            <addressOffset>0x3368</addressOffset>
            <addressOffset>0xd28</addressOffset>
        </register>
        <register>
            <name>MMFAR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Shows the address of the memory location that caused an MMU fault</description>
            <addressOffset>0x3372</addressOffset>
            <addressOffset>0xd2c</addressOffset>
        </register>
        <register>
            <name>BFAR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Shows the address associated with a precise data access fault</description>
            <addressOffset>0x3376</addressOffset>
            <addressOffset>0xd30</addressOffset>
        </register>
        <register>
            <name>AFSR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Latched version of the AUXFAULT inputs</description>
            <addressOffset>0x3380</addressOffset>
            <addressOffset>0xd34</addressOffset>
        </register>
        <register>
            <name>CPACR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Specifies the access privileges for coprocessors</description>
            <fields>
            <field>
                <name>CP11</name>
                <description>Defines access permissions for the CP11 coprocessor.</description>
                <bitRange>[23:22]</bitRange>
                <enumeratedValues>
                <name>E_CP_ACC_PERMISSION</name>
                <headerEnumName>E_CP_ACC_PERMISSION</headerEnumName>
                <enumeratedValue><name>Access_denied</name><description>Access denied</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Privileged_mode_access_only</name><description>Privileged mode access only</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Reserved</name><description>Reserved</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Full_access</name><description>Full access</description><value>3</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>CP10</name>
                <description>Defines access permissions for the CP10 coprocessor.</description>
                <bitRange>[21:20]</bitRange>
                <enumeratedValues derivedFrom="E_CP_ACC_PERMISSION"/>
            </field>
            <field>
                <name>CP7</name>
                <description>Defines access permissions for the CP7 coprocessor.</description>
                <bitRange>[15:14]</bitRange>
                <enumeratedValues derivedFrom="E_CP_ACC_PERMISSION"/>
            </field>
            <field>
                <name>CP6</name>
                <description>Defines access permissions for the CP6 coprocessor.</description>
                <bitRange>[13:12]</bitRange>
                <enumeratedValues derivedFrom="E_CP_ACC_PERMISSION"/>
            </field>
            <field>
                <name>CP5</name>
                <description>Defines access permissions for the CP5 coprocessor.</description>
                <bitRange>[11:10]</bitRange>
                <enumeratedValues derivedFrom="E_CP_ACC_PERMISSION"/>
            </field>
            <field>
                <name>CP4</name>
                <description>Defines access permissions for the CP4 coprocessor.</description>
                <bitRange>[9:8]</bitRange>
                <enumeratedValues derivedFrom="E_CP_ACC_PERMISSION"/>
            </field>
            <field>
                <name>CP3</name>
                <description>Defines access permissions for the CP3 coprocessor.</description>
                <bitRange>[7:6]</bitRange>
                <enumeratedValues derivedFrom="E_CP_ACC_PERMISSION"/>
            </field>
            <field>
                <name>CP2</name>
                <description>Defines access permissions for the CP2 coprocessor.</description>
                <bitRange>[5:4]</bitRange>
                <enumeratedValues derivedFrom="E_CP_ACC_PERMISSION"/>
            </field>
            <field>
                <name>CP1</name>
                <description>Defines access permissions for the CP1 coprocessor.</description>
                <bitRange>[3:2]</bitRange>
                <enumeratedValues derivedFrom="E_CP_ACC_PERMISSION"/>
            </field>
            <field>
                <name>CP0</name>
                <description>Defines access permissions for the CP0 coprocessor.</description>
                <bitRange>[1:0]</bitRange>
                <enumeratedValues derivedFrom="E_CP_ACC_PERMISSION"/>
            </field>
            </fields>
            <addressOffset>0x3456</addressOffset>
            <addressOffset>0xd80</addressOffset>
        </register>
        <register>
            <name>STIR</name>
            <size>32</size>
            <access>write-only</access>
            <description>Provides a mechanism for software to generate an interrupt</description>
            <fields>
            <field>
                <name>INTID</name>
                <description>Indicates the interrupt to be triggered. The value written is (ExceptionNumber - 16)</description>
                <bitRange>[8:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x3832</addressOffset>
            <addressOffset>0xef8</addressOffset>
        </register>
