ExponentialDeepSpace/KiCon2023Asia-Badge/fw/svd/N32L406_with_core.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>ID</name>
        <description>ID registers</description>
        <baseAddress>0xe000ed00</baseAddress>
        <addressBlock><offset>0x00000000</offset><size>0x00000004</size><usage>registers</usage></addressBlock>
        <addressBlock><offset>0x00000040</offset><size>0x00000034</size><usage>registers</usage></addressBlock>
        <registers>
        <register>
            <name>CPUID</name>
            <size>32</size>
            <access>read-only</access>
            <description>Identification information for the processor</description>
            <fields>
            <field>
                <name>Implementer</name>
                <description>Implementer code</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>Variant</name>
                <description>Implementation defined</description>
                <bitRange>[23:20]</bitRange>
            </field>
            <field>
                <name>Constant</name>
                <description>Indicates the architecture</description>
                <bitRange>[19:16]</bitRange>
            </field>
            <field>
                <name>Partno</name>
                <description>Indicates part number</description>
                <bitRange>[15:4]</bitRange>
            </field>
            <field>
                <name>Revision</name>
                <description>Indicates revision</description>
                <bitRange>[3:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x0</addressOffset>
            <addressOffset>0x0</addressOffset>
        </register>
        <register>
            <name>ID_PFR0</name>
            <size>32</size>
            <access>read-only</access>
            <description>None</description>
            <fields>
            <field>
                <name>State1</name>
                <description>Thumb instruction set support</description>
                <bitRange>[7:4]</bitRange>
                <enumeratedValues>
                <name>ID_PFR0_STATE1</name>
                <headerEnumName>ID_PFR0_STATE1</headerEnumName>
                <enumeratedValue><name>Thumb_Thumb2</name><description>Thumb Thumb2</description><value>3</value></enumeratedValue>
                </enumeratedValues>
            </field>
            </fields>
            <addressOffset>0x64</addressOffset>
            <addressOffset>0x40</addressOffset>
        </register>
        <register>
            <name>ID_PFR1</name>
            <size>32</size>
            <access>read-only</access>
            <description>None</description>
            <fields>
            <field>
                <name>M_Profile</name>
                <description>M profile programmers' model</description>
                <bitRange>[11:8]</bitRange>
                <enumeratedValues>
                <name>ID_PFR1_M_PROFILE</name>
                <headerEnumName>ID_PFR1_M_PROFILE</headerEnumName>
                <enumeratedValue><name>Two_stack</name><description>Two stack</description><value>2</value></enumeratedValue>
                </enumeratedValues>
            </field>
            </fields>
            <addressOffset>0x68</addressOffset>
            <addressOffset>0x44</addressOffset>
        </register>
        <register>
            <name>ID_DFR0</name>
            <size>32</size>
            <access>read-only</access>
            <description>None</description>
            <fields>
            <field>
                <name>M_Profile</name>
                <description>Debug model, M profile</description>
                <bitRange>[23:20]</bitRange>
                <enumeratedValues>
                <name>E_FEATURE_SUPPORT</name>
                <headerEnumName>E_FEATURE_SUPPORT</headerEnumName>
                <enumeratedValue><name>Not_supported</name><description>Not supported</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Supported</name><description>Supported</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            </fields>
            <addressOffset>0x72</addressOffset>
            <addressOffset>0x48</addressOffset>
        </register>
        <register>
            <name>ID_AFR0</name>
            <size>32</size>
            <access>read-only</access>
            <description>Implementation defined features</description>
            <addressOffset>0x76</addressOffset>
            <addressOffset>0x4c</addressOffset>
        </register>
        <register>
            <name>ID_MMFR0</name>
            <size>32</size>
            <access>read-only</access>
            <description>Memory Model Features</description>
            <fields>
            <field>
                <name>Auxiliary_registers</name>
                <description>Indicates support for Auxiliary registers</description>
                <bitRange>[23:20]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>Shareability_levels</name>
                <description>Indicates the number of shareability levels implemented</description>
                <bitRange>[15:12]</bitRange>
                <enumeratedValues>
                <name>ID_MMFR0_SHARABILITY</name>
                <headerEnumName>ID_MMFR0_SHARABILITY</headerEnumName>
                <enumeratedValue><name>One_level</name><description>One level</description><value>0</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>Outermost_shareability</name>
                <description>Indicates the outermost shareability domain implemented</description>
                <bitRange>[11:8]</bitRange>
                <enumeratedValues>
                <name>ID_MMFR0_OUTER_SHARABILITY</name>
                <headerEnumName>ID_MMFR0_OUTER_SHARABILITY</headerEnumName>
                <enumeratedValue><name>Non_cacheable</name><description>Non cacheable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Ignored</name><description>Ignored</description><value>15</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>PMSA</name>
                <description>Indicates support for a PMSA</description>
                <bitRange>[7:4]</bitRange>
                <enumeratedValues>
                <name>ID_MMFR0_PMSA</name>
                <headerEnumName>ID_MMFR0_PMSA</headerEnumName>
                <enumeratedValue><name>Not_supported</name><description>Not supported</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>PMSAv7</name><description>PMSAv7</description><value>3</value></enumeratedValue>
                </enumeratedValues>
            </field>
            </fields>
            <addressOffset>0x80</addressOffset>
            <addressOffset>0x50</addressOffset>
        </register>
        <register>
            <name>ID_MMFR1</name>
            <size>32</size>
            <access>read-only</access>
            <description>Memory Model Features</description>
            <addressOffset>0x84</addressOffset>
            <addressOffset>0x54</addressOffset>
        </register>
        <register>
            <name>ID_MMFR2</name>
            <size>32</size>
            <access>read-only</access>
            <description>Memory Model Features</description>
            <fields>
            <field>
                <name>WFI</name>
                <description>Indicates support for wait-for-interrupt stalling. </description>
                <bitRange>[27:24]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            </fields>
            <addressOffset>0x88</addressOffset>
            <addressOffset>0x58</addressOffset>
        </register>
        <register>
            <name>ID_MMFR3</name>
            <size>32</size>
            <access>read-only</access>
            <description>Memory Model Features</description>
            <addressOffset>0x92</addressOffset>
            <addressOffset>0x5c</addressOffset>
        </register>
        <register>
            <name>ID_ISAR0</name>
            <size>32</size>
            <access>read-only</access>
            <description>Instruction Set Attributes</description>
            <fields>
            <field>
                <name>Divide_instrs</name>
                <description>Indicates the supported divide instructions</description>
                <bitRange>[27:24]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>Debug_instrs</name>
                <description>Indicates the supported debug instructions</description>
                <bitRange>[23:20]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>Coproc_instrs</name>
                <description>Indicates the supported coprocessor instructions</description>
                <bitRange>[19:16]</bitRange>
                <enumeratedValues>
                <name>ID_ISAR0_COPROC</name>
                <headerEnumName>ID_ISAR0_COPROC</headerEnumName>
                <enumeratedValue><name>None</name><description>None</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Generic</name><description>Generic</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Generic2</name><description>Generic2</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>MCRR_MRRC</name><description>MCRR MRRC</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>MCRR2_MRRC2</name><description>MCRR2 MRRC2</description><value>4</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>CmpBranch_instrs</name>
                <description>Indicates support for combined compare and branch instructions.</description>
                <bitRange>[15:12]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>Bitfield_instrs</name>
                <description>Indicates support for bitfield instructions. </description>
                <bitRange>[11:8]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>BitCount_instrs</name>
                <description>Indicates support for bit counting instructions. </description>
                <bitRange>[7:4]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            </fields>
            <addressOffset>0x96</addressOffset>
            <addressOffset>0x60</addressOffset>
        </register>
        <register>
            <name>ID_ISAR1</name>
            <size>32</size>
            <access>read-only</access>
            <description>Instruction Set Attributes</description>
            <fields>
            <field>
                <name>Interwork_instrs</name>
                <description>Indicates support for instructions that branch between ARM and Thumb code.</description>
                <bitRange>[27:24]</bitRange>
                <enumeratedValues>
                <name>ID_ISAR1_INTERWORK</name>
                <headerEnumName>ID_ISAR1_INTERWORK</headerEnumName>
                <enumeratedValue><name>None</name><description>None</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>BX</name><description>BX</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>BX_BLX2</name><description>BX BLX2</description><value>2</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>Immediate_instrs</name>
                <description>Indicates support for immediate instructions. </description>
                <bitRange>[23:20]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>IfThen_instrs</name>
                <description>Indicates support for IfThen instructions.</description>
                <bitRange>[19:16]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>Extend_instrs</name>
                <description>Indicates support for sign or zero extend instructions. </description>
                <bitRange>[15:12]</bitRange>
            </field>
            </fields>
            <addressOffset>0x100</addressOffset>
            <addressOffset>0x64</addressOffset>
        </register>
        <register>
            <name>ID_ISAR2</name>
            <size>32</size>
            <access>read-only</access>
            <description>Instruction Set Attributes</description>
            <fields>
            <field>
                <name>Reversal_instrs</name>
                <description>Indicates the supported reversal instructions. </description>
                <bitRange>[31:28]</bitRange>
            </field>
            <field>
                <name>MultU_instrs</name>
                <description>Indicates the supported advanced unsigned multiply instructions.</description>
                <bitRange>[23:20]</bitRange>
            </field>
            <field>
                <name>MultS_instrs</name>
                <description>Indicates the supported advanced signed multiply instructions.</description>
                <bitRange>[19:16]</bitRange>
            </field>
            <field>
                <name>Mult_instrs</name>
                <description>Indicates the supported additional multiply instructions. </description>
                <bitRange>[15:12]</bitRange>
            </field>
            <field>
                <name>MultiAccessInt_instrs</name>
                <description>Indicates the supported multi-access interruptible instructions.</description>
                <bitRange>[11:4]</bitRange>
            </field>
            <field>
                <name>LoadStore_instrs</name>
                <description>Indicates the supported additional load and store instructions. </description>
                <bitRange>[3:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x104</addressOffset>
            <addressOffset>0x68</addressOffset>
        </register>
        <register>
            <name>ID_ISAR3</name>
            <size>32</size>
            <access>read-only</access>
            <description>Instruction Set Attributes</description>
            <fields>
            <field>
                <name>TrueNOP_instrs</name>
                <description>Indicates support for true NOP instructions.</description>
                <bitRange>[27:24]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>ThumbCopy_instrs</name>
                <description>Indicates support for Thumb copy instructions. </description>
                <bitRange>[23:20]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>TabBranch_instrs</name>
                <description>Indicates support for table branch instructions. </description>
                <bitRange>[19:16]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>SynchPrim_instrs</name>
                <description>Indicates support for synchronization primitive instructions.</description>
                <bitRange>[15:12]</bitRange>
            </field>
            <field>
                <name>SVC_instrs</name>
                <description>Indicates support for SVC instructions.</description>
                <bitRange>[11:8]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>SIMD_instrs</name>
                <description>Indicates support for Single Instruction Multiple Data (SIMD) instructions.</description>
                <bitRange>[7:4]</bitRange>
            </field>
            <field>
                <name>Saturate_instrs</name>
                <description>Indicates support for saturate instructions. </description>
                <bitRange>[3:0]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            </fields>
            <addressOffset>0x108</addressOffset>
            <addressOffset>0x6c</addressOffset>
        </register>
        <register>
            <name>ID_ISAR4</name>
            <size>32</size>
            <access>read-only</access>
            <description>Instruction Set Attributes</description>
            <fields>
            <field>
                <name>PSR_M_instrs</name>
                <description>Indicates support for saturate instructions. </description>
                <bitRange>[27:24]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>SynchPrim_instrs_frac</name>
                <description>Indicates support for Synchronization Primitives</description>
                <bitRange>[23:20]</bitRange>
            </field>
            <field>
                <name>Barrier_instrs</name>
                <description>Indicates the supported barrier instructions. </description>
                <bitRange>[19:16]</bitRange>
                <enumeratedValues derivedFrom="E_FEATURE_SUPPORT"/>
            </field>
            <field>
                <name>Writeback_instrs</name>
                <description>Indicates support for Writeback addressing modes</description>
                <bitRange>[11:8]</bitRange>
                <enumeratedValues>
                <name>E_BASIC_FULL</name>
                <headerEnumName>E_BASIC_FULL</headerEnumName>
                <enumeratedValue><name>Basic</name><description>Basic</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Full</name><description>Full</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>WithShifts_instrs</name>
                <description>Indicates the support for instructions with shifts:</description>
                <bitRange>[7:4]</bitRange>
            </field>
            <field>
                <name>Unpriv_instrs</name>
                <description>Indicates the supported unprivileged instructions</description>
                <bitRange>[3:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x112</addressOffset>
            <addressOffset>0x70</addressOffset>
        </register>
