ExponentialDeepSpace/KiCon2023Asia-Badge/fw/svd/N32L406_with_core.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>FPE</name>
        <description>System Control registers for the FP extension</description>
        <baseAddress>0xe000ef34</baseAddress>
        <addressBlock><offset>0x00000000</offset><size>0x00000014</size><usage>registers</usage></addressBlock>
        <registers>
        <register>
            <name>FPCCR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Holds control data for the floating-point unit</description>
            <fields>
            <field>
                <name>ASPEN</name>
                <description>When this bit is set to 1, execution of a floating-point instruction sets the CONTROL.FPCA bit to 1</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>LSPEN</name>
                <description>Enables lazy context save of FP state</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>E_DISABLE_ENABLE</name>
                <headerEnumName>E_DISABLE_ENABLE</headerEnumName>
                <enumeratedValue><name>Disable</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enable</name><description>Enable</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>MONRDY</name>
                <description>Indicates whether the software executing when the processor allocated the FP stack frame was able to set the DebugMonitor exception to pending</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>E_NOTABLE_ABLE</name>
                <headerEnumName>E_NOTABLE_ABLE</headerEnumName>
                <enumeratedValue><name>Not_Able</name><description>Not Able</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Able</name><description>Able</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>BFRDY</name>
                <description>Indicates whether the software executing when the processor allocated the FP stack frame was able to set the BusFault exception to pending</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="E_NOTABLE_ABLE"/>
            </field>
            <field>
                <name>MMRDY</name>
                <description>Indicates whether the software executing when the processor allocated the FP stack frame was able to set the MemManage exception to pending</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="E_NOTABLE_ABLE"/>
            </field>
            <field>
                <name>HFRDY</name>
                <description>Indicates whether the software executing when the processor allocated the FP stack frame was able to set the HardFault exception to pending</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues derivedFrom="E_NOTABLE_ABLE"/>
            </field>
            <field>
                <name>THREAD</name>
                <description>Indicates the processor mode when it allocated the FP stack frame</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>E_HANDLER_THREAD</name>
                <headerEnumName>E_HANDLER_THREAD</headerEnumName>
                <enumeratedValue><name>Handler</name><description>Handler</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Thread</name><description>Thread</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>USER</name>
                <description>Indicates the privilege level of the software executing when the processor allocated the FP stack frame</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>E_PRIV_UNPRIV</name>
                <headerEnumName>E_PRIV_UNPRIV</headerEnumName>
                <enumeratedValue><name>Privileged</name><description>Privileged</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Unprivileged</name><description>Unprivileged</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>LSPACT</name>
                <description>Indicates whether Lazy preservation of the FP state is active</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>E_NOTACTIVE_ACTIVE</name>
                <headerEnumName>E_NOTACTIVE_ACTIVE</headerEnumName>
                <enumeratedValue><name>Not_Active</name><description>Not Active</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Active</name><description>Active</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            </fields>
            <addressOffset>0x0</addressOffset>
            <addressOffset>0x0</addressOffset>
        </register>
        <register>
            <name>FPCAR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Holds the location of the unpopulated floating-point register space allocated on an exception stack frame</description>
            <addressOffset>0x4</addressOffset>
            <addressOffset>0x4</addressOffset>
        </register>
        <register>
            <name>FPDSCR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Holds the default values for the floating-point status control data that the processor assigns to the FPSCR when it creates a new floating-point context</description>
            <fields>
            <field>
                <name>AHP</name>
                <description>Default value for FPSCR.AHP</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>DN</name>
                <description>Default value for FPSCR.DN</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>FZ</name>
                <description>Default value for FPSCR.FZ</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>RMode</name>
                <description>Default value for FPSCR.RMode</description>
                <bitRange>[23:22]</bitRange>
            </field>
            </fields>
            <addressOffset>0x8</addressOffset>
            <addressOffset>0x8</addressOffset>
        </register>
        <register>
            <name>MVFR0</name>
            <size>32</size>
            <access>read-only</access>
            <description>Describes the features provided by the Floating-point extension</description>
            <fields>
            <field>
                <name>FP_Rounding_modes</name>
                <description>Indicates the rounding modes supported by the FP floating-point hardware</description>
                <bitRange>[31:28]</bitRange>
                <enumeratedValues>
                <name>E_SUPPORTED</name>
                <headerEnumName>E_SUPPORTED</headerEnumName>
                <enumeratedValue><name>Supported</name><description>Supported</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>Short_vectors</name>
                <description>Indicates the hardware support for FP short vectors</description>
                <bitRange>[27:24]</bitRange>
                <enumeratedValues>
                <name>E_NOT_SUPPORTED</name>
                <headerEnumName>E_NOT_SUPPORTED</headerEnumName>
                <enumeratedValue><name>Not_Supported</name><description>Not Supported</description><value>0</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>Square_root</name>
                <description>Indicates the hardware support for FP square root operations</description>
                <bitRange>[23:20]</bitRange>
                <enumeratedValues derivedFrom="E_SUPPORTED"/>
            </field>
            <field>
                <name>Divide</name>
                <description>Indicates the hardware support for FP divide operations</description>
                <bitRange>[19:16]</bitRange>
                <enumeratedValues derivedFrom="E_SUPPORTED"/>
            </field>
            <field>
                <name>FP_exception_trapping</name>
                <description>Indicates whether the FP hardware implementation supports exception trapping</description>
                <bitRange>[15:12]</bitRange>
                <enumeratedValues derivedFrom="E_NOT_SUPPORTED"/>
            </field>
            <field>
                <name>Double_precision</name>
                <description>Indicates the hardware support for FP double-precision operations</description>
                <bitRange>[11:8]</bitRange>
                <enumeratedValues derivedFrom="E_NOT_SUPPORTED"/>
            </field>
            <field>
                <name>Single_precision</name>
                <description>Indicates the hardware support for FP single-precision operations</description>
                <bitRange>[7:4]</bitRange>
                <enumeratedValues>
                <name>E_SUPPORTED2</name>
                <headerEnumName>E_SUPPORTED2</headerEnumName>
                <enumeratedValue><name>Supported</name><description>Supported</description><value>2</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>A_SIMD</name>
                <description>Indicates the size of the FP register bank</description>
                <bitRange>[3:0]</bitRange>
                <enumeratedValues>
                <name>E_MVFR0_SIMD</name>
                <headerEnumName>E_MVFR0_SIMD</headerEnumName>
                <enumeratedValue><name>_16x64</name><description> 16x64</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            </fields>
            <addressOffset>0x12</addressOffset>
            <addressOffset>0xc</addressOffset>
        </register>
        <register>
            <name>MVFR1</name>
            <size>32</size>
            <access>read-only</access>
            <description>Describes the features provided by the Floating-point extension</description>
            <fields>
            <field>
                <name>FP_fused_MAC</name>
                <description>Indicates whether the FP supports fused multiply accumulate operations</description>
                <bitRange>[31:28]</bitRange>
                <enumeratedValues derivedFrom="E_SUPPORTED"/>
            </field>
            <field>
                <name>FP_HPFP</name>
                <description>Indicates whether the FP supports half-precision floating-point conversion operations</description>
                <bitRange>[27:24]</bitRange>
                <enumeratedValues derivedFrom="E_SUPPORTED"/>
            </field>
            <field>
                <name>D_NaN</name>
                <description>Indicates whether the FP hardware implementation supports only the Default NaN mode</description>
                <bitRange>[7:4]</bitRange>
                <enumeratedValues derivedFrom="E_SUPPORTED"/>
            </field>
            <field>
                <name>FtZ</name>
                <description>Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation</description>
                <bitRange>[3:0]</bitRange>
                <enumeratedValues derivedFrom="E_SUPPORTED"/>
            </field>
            </fields>
            <addressOffset>0x16</addressOffset>
            <addressOffset>0x10</addressOffset>
        </register>
