ExponentialDeepSpace/KiCon2023Asia-Badge/fw/svd/N32L406_with_core.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>SysTick</name>
        <description>System Timer registers</description>
        <baseAddress>0xe000e010</baseAddress>
        <addressBlock><offset>0x00000000</offset><size>0x00000010</size><usage>registers</usage></addressBlock>
        <registers>
        <register>
            <name>STCSR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Controls the system timer and provides status data</description>
            <fields>
            <field>
                <name>COUNTFLAG</name>
                <description>Indicates whether the counter has counted to 0 since the last read of this register</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>SYST_CSR_COUNTFLAG</name>
                <headerEnumName>SYST_CSR_COUNTFLAG</headerEnumName>
                <enumeratedValue><name>not_counted_to_0</name><description>not counted to 0</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>counted_to_0</name><description>counted to 0</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>CLKSOURCE</name>
                <description>Indicates the SysTick clock source</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>SYST_CSR_CLKSOURCE</name>
                <headerEnumName>SYST_CSR_CLKSOURCE</headerEnumName>
                <enumeratedValue><name>External_clock</name><description>External clock</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Processor_clock</name><description>Processor clock</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>TICKINT</name>
                <description>Indicates whether counting to 0 causes the status of the SysTick exception to change to pending</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>SYST_CSR_TICKINT</name>
                <headerEnumName>SYST_CSR_TICKINT</headerEnumName>
                <enumeratedValue><name>Does_not_affect_exception_status</name><description>Does not affect exception status</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Changes_exception_status</name><description>Changes exception status</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>ENABLE</name>
                <description>Indicates the enabled status of the SysTick counter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>SYST_CSR_ENABLE</name>
                <headerEnumName>SYST_CSR_ENABLE</headerEnumName>
                <enumeratedValue><name>Counter_disabled</name><description>Counter disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Counter_operating</name><description>Counter operating</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            </fields>
            <addressOffset>0x0</addressOffset>
            <addressOffset>0x0</addressOffset>
        </register>
        <register>
            <name>STRVR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads the reload value of the SYST_CVR register</description>
            <fields>
            <field>
                <name>RELOAD</name>
                <description>The value to load into the SYST_CVR register when the counter reaches 0</description>
                <bitRange>[23:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x4</addressOffset>
            <addressOffset>0x4</addressOffset>
        </register>
        <register>
            <name>STCVR</name>
            <size>32</size>
            <access>read-write</access>
            <description>Reads or clears the current counter value</description>
            <fields>
            <field>
                <name>CURRENT</name>
                <description>This is the value of the counter at the time it is sampled</description>
                <bitRange>[23:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x8</addressOffset>
            <addressOffset>0x8</addressOffset>
        </register>
        <register>
            <name>STCR</name>
            <size>32</size>
            <access>read-only</access>
            <description>Reads the calibration value and parameters for SysTick</description>
            <fields>
            <field>
                <name>NOREF</name>
                <description>Indicates whether the IMPLEMENTATION DEFINED reference clock is provided</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>SYST_CALIB_NOREF</name>
                <headerEnumName>SYST_CALIB_NOREF</headerEnumName>
                <enumeratedValue><name>Implemented</name><description>Implemented</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Not_implemented</name><description>Not implemented</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>SKEW</name>
                <description>Indicates whether the 10ms calibration value is exact</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                <name>SYST_CALIB_SKEW</name>
                <headerEnumName>SYST_CALIB_SKEW</headerEnumName>
                <enumeratedValue><name>Exact</name><description>Exact</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Inexact</name><description>Inexact</description><value>1</value></enumeratedValue>
                </enumeratedValues>
            </field>
            <field>
                <name>TENMS</name>
                <description>Optionally, holds a reload value to be used for 10ms (100Hz) timing, subject to system clock skew errors</description>
                <bitRange>[23:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x12</addressOffset>
            <addressOffset>0xc</addressOffset>
        </register>
