ExponentialDeepSpace/KiCon2023Asia-Badge/fw/svd/N32L406_with_core.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>NVIC</name>
        <description>Nested Vectored Interrupt Controller registers</description>
        <baseAddress>0xe000e004</baseAddress>
        <addressBlock><offset>0x00000000</offset><size>0x00000004</size><usage>registers</usage></addressBlock>
        <addressBlock><offset>0x000000fc</offset><size>0x00000020</size><usage>registers</usage></addressBlock>
        <addressBlock><offset>0x0000017c</offset><size>0x00000020</size><usage>registers</usage></addressBlock>
        <addressBlock><offset>0x000001fc</offset><size>0x00000020</size><usage>registers</usage></addressBlock>
        <addressBlock><offset>0x0000027c</offset><size>0x00000020</size><usage>registers</usage></addressBlock>
        <addressBlock><offset>0x000002fc</offset><size>0x00000020</size><usage>registers</usage></addressBlock>
        <addressBlock><offset>0x000003fc</offset><size>0x000000f0</size><usage>registers</usage></addressBlock>
        <registers>
        <register>
            <name>ICTR</name>
            <size>32</size>
            <access>read-only</access>
            <description>Provides information about the interrupt controller</description>
            <fields>
            <field>
                <name>INTLINESNUM</name>
                <description>The total number of interrupt lines supported n, defined in groups of
    32. That is, the total number of interrupt lines is up to (32*(INTLINESNUM+1)). However,
    the absolute maximum number of interrupts is 496, corresponding to the INTLINESNUM
    value 0b1111.</description>
                <bitRange>[3:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x0</addressOffset>
            <addressOffset>0x0</addressOffset>
        </register>
        <register>
            <name>NVIC_ISER0</name>
            <size>32</size>
            <access>read-write</access>
            <description>Enables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x252</addressOffset>
            <addressOffset>0xfc</addressOffset>
        </register>
        <register>
            <name>NVIC_ISER1</name>
            <size>32</size>
            <access>read-write</access>
            <description>Enables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x256</addressOffset>
            <addressOffset>0x100</addressOffset>
        </register>
        <register>
            <name>NVIC_ISER2</name>
            <size>32</size>
            <access>read-write</access>
            <description>Enables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x260</addressOffset>
            <addressOffset>0x104</addressOffset>
        </register>
        <register>
            <name>NVIC_ISER3</name>
            <size>32</size>
            <access>read-write</access>
            <description>Enables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x264</addressOffset>
            <addressOffset>0x108</addressOffset>
        </register>
        <register>
            <name>NVIC_ISER4</name>
            <size>32</size>
            <access>read-write</access>
            <description>Enables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x268</addressOffset>
            <addressOffset>0x10c</addressOffset>
        </register>
        <register>
            <name>NVIC_ISER5</name>
            <size>32</size>
            <access>read-write</access>
            <description>Enables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x272</addressOffset>
            <addressOffset>0x110</addressOffset>
        </register>
        <register>
            <name>NVIC_ISER6</name>
            <size>32</size>
            <access>read-write</access>
            <description>Enables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x276</addressOffset>
            <addressOffset>0x114</addressOffset>
        </register>
        <register>
            <name>NVIC_ISER7</name>
            <size>32</size>
            <access>read-write</access>
            <description>Enables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x280</addressOffset>
            <addressOffset>0x118</addressOffset>
        </register>
        <register>
            <name>NVIC_ICER0</name>
            <size>32</size>
            <access>read-write</access>
            <description>Disables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x380</addressOffset>
            <addressOffset>0x17c</addressOffset>
        </register>
        <register>
            <name>NVIC_ICER1</name>
            <size>32</size>
            <access>read-write</access>
            <description>Disables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x384</addressOffset>
            <addressOffset>0x180</addressOffset>
        </register>
        <register>
            <name>NVIC_ICER2</name>
            <size>32</size>
            <access>read-write</access>
            <description>Disables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x388</addressOffset>
            <addressOffset>0x184</addressOffset>
        </register>
        <register>
            <name>NVIC_ICER3</name>
            <size>32</size>
            <access>read-write</access>
            <description>Disables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x392</addressOffset>
            <addressOffset>0x188</addressOffset>
        </register>
        <register>
            <name>NVIC_ICER4</name>
            <size>32</size>
            <access>read-write</access>
            <description>Disables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x396</addressOffset>
            <addressOffset>0x18c</addressOffset>
        </register>
        <register>
            <name>NVIC_ICER5</name>
            <size>32</size>
            <access>read-write</access>
            <description>Disables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x400</addressOffset>
            <addressOffset>0x190</addressOffset>
        </register>
        <register>
            <name>NVIC_ICER6</name>
            <size>32</size>
            <access>read-write</access>
            <description>Disables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x404</addressOffset>
            <addressOffset>0x194</addressOffset>
        </register>
        <register>
            <name>NVIC_ICER7</name>
            <size>32</size>
            <access>read-write</access>
            <description>Disables, or reads the enable state of a group of interrupts</description>
            <addressOffset>0x408</addressOffset>
            <addressOffset>0x198</addressOffset>
        </register>
        <register>
            <name>NVIC_ISPR0</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, changes interrupt status to pending, or shows the current pending
    status</description>
            <addressOffset>0x508</addressOffset>
            <addressOffset>0x1fc</addressOffset>
        </register>
        <register>
            <name>NVIC_ISPR1</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, changes interrupt status to pending, or shows the current pending
    status</description>
            <addressOffset>0x512</addressOffset>
            <addressOffset>0x200</addressOffset>
        </register>
        <register>
            <name>NVIC_ISPR2</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, changes interrupt status to pending, or shows the current pending
    status</description>
            <addressOffset>0x516</addressOffset>
            <addressOffset>0x204</addressOffset>
        </register>
        <register>
            <name>NVIC_ISPR3</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, changes interrupt status to pending, or shows the current pending
    status</description>
            <addressOffset>0x520</addressOffset>
            <addressOffset>0x208</addressOffset>
        </register>
        <register>
            <name>NVIC_ISPR4</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, changes interrupt status to pending, or shows the current pending
    status</description>
            <addressOffset>0x524</addressOffset>
            <addressOffset>0x20c</addressOffset>
        </register>
        <register>
            <name>NVIC_ISPR5</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, changes interrupt status to pending, or shows the current pending
    status</description>
            <addressOffset>0x528</addressOffset>
            <addressOffset>0x210</addressOffset>
        </register>
        <register>
            <name>NVIC_ISPR6</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, changes interrupt status to pending, or shows the current pending
    status</description>
            <addressOffset>0x532</addressOffset>
            <addressOffset>0x214</addressOffset>
        </register>
        <register>
            <name>NVIC_ISPR7</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, changes interrupt status to pending, or shows the current pending
    status</description>
            <addressOffset>0x536</addressOffset>
            <addressOffset>0x218</addressOffset>
        </register>
        <register>
            <name>NVIC_ICPR0</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, clears the interrupt pending status, or shows the current pending
    status</description>
            <addressOffset>0x636</addressOffset>
            <addressOffset>0x27c</addressOffset>
        </register>
        <register>
            <name>NVIC_ICPR1</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, clears the interrupt pending status, or shows the current pending
    status</description>
            <addressOffset>0x640</addressOffset>
            <addressOffset>0x280</addressOffset>
        </register>
        <register>
            <name>NVIC_ICPR2</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, clears the interrupt pending status, or shows the current pending
    status</description>
            <addressOffset>0x644</addressOffset>
            <addressOffset>0x284</addressOffset>
        </register>
        <register>
            <name>NVIC_ICPR3</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, clears the interrupt pending status, or shows the current pending
    status</description>
            <addressOffset>0x648</addressOffset>
            <addressOffset>0x288</addressOffset>
        </register>
        <register>
            <name>NVIC_ICPR4</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, clears the interrupt pending status, or shows the current pending
    status</description>
            <addressOffset>0x652</addressOffset>
            <addressOffset>0x28c</addressOffset>
        </register>
        <register>
            <name>NVIC_ICPR5</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, clears the interrupt pending status, or shows the current pending
    status</description>
            <addressOffset>0x656</addressOffset>
            <addressOffset>0x290</addressOffset>
        </register>
        <register>
            <name>NVIC_ICPR6</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, clears the interrupt pending status, or shows the current pending
    status</description>
            <addressOffset>0x660</addressOffset>
            <addressOffset>0x294</addressOffset>
        </register>
        <register>
            <name>NVIC_ICPR7</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of interrupts, clears the interrupt pending status, or shows the current pending
    status</description>
            <addressOffset>0x664</addressOffset>
            <addressOffset>0x298</addressOffset>
        </register>
        <register>
            <name>NVIC_IABR0</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of 32 interrupts, shows whether each interrupt is active</description>
            <addressOffset>0x764</addressOffset>
            <addressOffset>0x2fc</addressOffset>
        </register>
        <register>
            <name>NVIC_IABR1</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of 32 interrupts, shows whether each interrupt is active</description>
            <addressOffset>0x768</addressOffset>
            <addressOffset>0x300</addressOffset>
        </register>
        <register>
            <name>NVIC_IABR2</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of 32 interrupts, shows whether each interrupt is active</description>
            <addressOffset>0x772</addressOffset>
            <addressOffset>0x304</addressOffset>
        </register>
        <register>
            <name>NVIC_IABR3</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of 32 interrupts, shows whether each interrupt is active</description>
            <addressOffset>0x776</addressOffset>
            <addressOffset>0x308</addressOffset>
        </register>
        <register>
            <name>NVIC_IABR4</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of 32 interrupts, shows whether each interrupt is active</description>
            <addressOffset>0x780</addressOffset>
            <addressOffset>0x30c</addressOffset>
        </register>
        <register>
            <name>NVIC_IABR5</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of 32 interrupts, shows whether each interrupt is active</description>
            <addressOffset>0x784</addressOffset>
            <addressOffset>0x310</addressOffset>
        </register>
        <register>
            <name>NVIC_IABR6</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of 32 interrupts, shows whether each interrupt is active</description>
            <addressOffset>0x788</addressOffset>
            <addressOffset>0x314</addressOffset>
        </register>
        <register>
            <name>NVIC_IABR7</name>
            <size>32</size>
            <access>read-write</access>
            <description>For a group of 32 interrupts, shows whether each interrupt is active</description>
            <addressOffset>0x792</addressOffset>
            <addressOffset>0x318</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR0</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 3</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 2</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 1</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 0</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1020</addressOffset>
            <addressOffset>0x3fc</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR1</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 7</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 6</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 5</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 4</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1024</addressOffset>
            <addressOffset>0x400</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR2</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 11</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 10</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 9</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 8</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1028</addressOffset>
            <addressOffset>0x404</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR3</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 15</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 14</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 13</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 12</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1032</addressOffset>
            <addressOffset>0x408</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR4</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 19</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 18</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 17</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 16</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1036</addressOffset>
            <addressOffset>0x40c</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR5</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 23</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 22</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 21</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 20</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1040</addressOffset>
            <addressOffset>0x410</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR6</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 27</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 26</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 25</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 24</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1044</addressOffset>
            <addressOffset>0x414</addressOffset>
        </register>
