ExponentialDeepSpace/KiCon2023Asia-Badge/fw/svd/N32L406_with_core.svd
        <register>
            <name>NVIC_IPR7</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 31</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 30</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 29</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 28</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1048</addressOffset>
            <addressOffset>0x418</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR8</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 35</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 34</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 33</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 32</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1052</addressOffset>
            <addressOffset>0x41c</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR9</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 39</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 38</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 37</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 36</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1056</addressOffset>
            <addressOffset>0x420</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR10</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 43</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 42</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 41</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 40</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1060</addressOffset>
            <addressOffset>0x424</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR11</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 47</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 46</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 45</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 44</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1064</addressOffset>
            <addressOffset>0x428</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR12</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 51</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 50</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 49</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 48</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1068</addressOffset>
            <addressOffset>0x42c</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR13</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 55</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 54</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 53</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 52</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1072</addressOffset>
            <addressOffset>0x430</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR14</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 59</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 58</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 57</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 56</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1076</addressOffset>
            <addressOffset>0x434</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR15</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 63</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 62</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 61</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 60</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1080</addressOffset>
            <addressOffset>0x438</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR16</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 67</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 66</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 65</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 64</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1084</addressOffset>
            <addressOffset>0x43c</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR17</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 71</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 70</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 69</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 68</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1088</addressOffset>
            <addressOffset>0x440</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR18</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 75</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 74</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 73</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 72</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1092</addressOffset>
            <addressOffset>0x444</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR19</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 79</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 78</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 77</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 76</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1096</addressOffset>
            <addressOffset>0x448</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR20</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 83</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 82</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 81</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 80</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1100</addressOffset>
            <addressOffset>0x44c</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR21</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 87</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 86</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 85</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 84</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1104</addressOffset>
            <addressOffset>0x450</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR22</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 91</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 90</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 89</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 88</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1108</addressOffset>
            <addressOffset>0x454</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR23</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 95</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 94</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 93</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 92</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1112</addressOffset>
            <addressOffset>0x458</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR24</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 99</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 98</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 97</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 96</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1116</addressOffset>
            <addressOffset>0x45c</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR25</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 103</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 102</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 101</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 100</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1120</addressOffset>
            <addressOffset>0x460</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR26</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 107</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 106</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 105</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 104</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1124</addressOffset>
            <addressOffset>0x464</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR27</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 111</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 110</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 109</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 108</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1128</addressOffset>
            <addressOffset>0x468</addressOffset>
        </register>
