ExponentialDeepSpace/KiCon2023Asia-Badge/fw/svd/N32L406_with_core.svd
        <register>
            <name>NVIC_IPR28</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 115</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 114</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 113</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 112</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1132</addressOffset>
            <addressOffset>0x46c</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR29</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 119</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 118</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 117</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 116</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1136</addressOffset>
            <addressOffset>0x470</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR30</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 123</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 122</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 121</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 120</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1140</addressOffset>
            <addressOffset>0x474</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR31</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 127</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 126</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 125</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 124</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1144</addressOffset>
            <addressOffset>0x478</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR32</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 131</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 130</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 129</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 128</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1148</addressOffset>
            <addressOffset>0x47c</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR33</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 135</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 134</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 133</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 132</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1152</addressOffset>
            <addressOffset>0x480</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR34</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 139</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 138</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 137</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 136</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1156</addressOffset>
            <addressOffset>0x484</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR35</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 143</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 142</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 141</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 140</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1160</addressOffset>
            <addressOffset>0x488</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR36</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 147</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 146</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 145</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 144</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1164</addressOffset>
            <addressOffset>0x48c</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR37</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 151</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 150</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 149</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 148</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1168</addressOffset>
            <addressOffset>0x490</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR38</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 155</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 154</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 153</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 152</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1172</addressOffset>
            <addressOffset>0x494</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR39</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 159</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 158</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 157</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 156</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1176</addressOffset>
            <addressOffset>0x498</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR40</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 163</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 162</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 161</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 160</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1180</addressOffset>
            <addressOffset>0x49c</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR41</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 167</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 166</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 165</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 164</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1184</addressOffset>
            <addressOffset>0x4a0</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR42</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 171</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 170</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 169</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 168</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1188</addressOffset>
            <addressOffset>0x4a4</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR43</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 175</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 174</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 173</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 172</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1192</addressOffset>
            <addressOffset>0x4a8</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR44</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 179</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 178</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 177</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 176</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1196</addressOffset>
            <addressOffset>0x4ac</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR45</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 183</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 182</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 181</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 180</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1200</addressOffset>
            <addressOffset>0x4b0</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR46</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 187</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 186</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 185</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 184</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1204</addressOffset>
            <addressOffset>0x4b4</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR47</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 191</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 190</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 189</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 188</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1208</addressOffset>
            <addressOffset>0x4b8</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR48</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 195</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 194</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 193</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 192</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1212</addressOffset>
            <addressOffset>0x4bc</addressOffset>
        </register>
