ExponentialDeepSpace/KiCon2023Asia-Badge/fw/svd/N32L406_with_core.svd
        <register>
            <name>NVIC_IPR49</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 199</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 198</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 197</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 196</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1216</addressOffset>
            <addressOffset>0x4c0</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR50</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 203</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 202</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 201</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 200</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1220</addressOffset>
            <addressOffset>0x4c4</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR51</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 207</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 206</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 205</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 204</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1224</addressOffset>
            <addressOffset>0x4c8</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR52</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 211</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 210</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 209</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 208</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1228</addressOffset>
            <addressOffset>0x4cc</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR53</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 215</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 214</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 213</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 212</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1232</addressOffset>
            <addressOffset>0x4d0</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR54</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 219</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 218</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 217</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 216</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1236</addressOffset>
            <addressOffset>0x4d4</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR55</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 223</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 222</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 221</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 220</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1240</addressOffset>
            <addressOffset>0x4d8</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR56</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 227</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 226</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 225</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 224</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1244</addressOffset>
            <addressOffset>0x4dc</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR57</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 231</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 230</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 229</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 228</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1248</addressOffset>
            <addressOffset>0x4e0</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR58</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 235</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 234</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 233</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 232</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1252</addressOffset>
            <addressOffset>0x4e4</addressOffset>
        </register>
        <register>
            <name>NVIC_IPR59</name>
            <size>32</size>
            <access>read-write</access>
            <description>Sets or reads interrupt priorities</description>
            <fields>
            <field>
                <name>PRI_N3</name>
                <description>Priority of interrupt 239</description>
                <bitRange>[31:24]</bitRange>
            </field>
            <field>
                <name>PRI_N2</name>
                <description>Priority of interrupt 238</description>
                <bitRange>[23:16]</bitRange>
            </field>
            <field>
                <name>PRI_N1</name>
                <description>Priority of interrupt 237</description>
                <bitRange>[15:8]</bitRange>
            </field>
            <field>
                <name>PRI_N0</name>
                <description>Priority of interrupt 236</description>
                <bitRange>[7:0]</bitRange>
            </field>
            </fields>
            <addressOffset>0x1256</addressOffset>
            <addressOffset>0x4e8</addressOffset>
        </register>
