ExponentialDeepSpace/KiCon2023Asia-Badge/fw/svd/N32L406_with_core.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>COMP</name>
            <description>comparator</description>
            <groupName>COMP</groupName>
            <baseAddress>0x40002400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>COMP</name>
                <description>COMP1/2 global interrupt through EXTI line 21/22</description>
                <value>22</value>
            </interrupt>
            <registers>
                <register>
                    <name>COMP_INTEN</name>
                    <displayName>COMP_INTEN</displayName>
                    <description>COMP_INTEN</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>CMP1IEN</name>
                            <description>CMP1IEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP2IEN</name>
                            <description>CMP2IEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
					</fields>
                </register>
                <register>
                    <name>COMP_LPCKSEL</name>
                    <displayName>COMP_LPCKSEL</displayName>
                    <description>COMP_LPCKSEL</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>LPCKSEL</name>
                            <description>LPCKSEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
					</fields>
                </register>
                <register>
                    <name>COMP_WINMODE</name>
                    <displayName>COMP_WINMODE</displayName>
                    <description>COMP_WINMODE</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>CMP12MD</name>
                            <description>CMP12MD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_LOCK</name>
                    <displayName>COMP_LOCK</displayName>
                    <description>COMP_LOCK</description>
                    <addressOffset>0x0c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>CMP1LK</name>
                            <description>CMP1LK</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP2LK</name>
                            <description>CMP2LK</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP1_CTRL</name>
                    <displayName>COMP1_CTRL</displayName>
                    <description>COMP1_CTRL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffef</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INMSEL</name>
                            <description>INMSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>INPSEL</name>
                            <description>INPSEL</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>OUTTRG</name>
                            <description>OUTTRG</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>POL</name>
                            <description>POL</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HYST</name>
                            <description>HYST</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLKING</name>
                            <description>BLKING</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUT</name>
                            <description>OUT</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INPDAC</name>
                            <description>INPDAC</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWRMODE</name>
                            <description>PWRMODE</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP1_FILC</name>
                    <displayName>COMP1_FILC</displayName>
                    <description>COMP1_FILC</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000007ff</resetMask>
                    <fields>
                        <field>
                            <name>FILEN</name>
                            <description>FILEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SAMPW</name>
                            <description>SAMPW</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP1_FILP</name>
                    <displayName>COMP1_FILP</displayName>
                    <description>COMP1_FILP</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CLKPSC</name>
                            <description>CLKPSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP2_CTRL</name>
                    <displayName>COMP2_CTRL</displayName>
                    <description>COMP2_CTRL</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffef</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INMSEL</name>
                            <description>INMSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>INPSEL</name>
                            <description>INPSEL</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>OUTTRG</name>
                            <description>OUTTRG</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>POL</name>
                            <description>POL</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HYST</name>
                            <description>HYST</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLKING</name>
                            <description>BLKING</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUT</name>
                            <description>OUT</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP2_FILC</name>
                    <displayName>COMP2_FILC</displayName>
                    <description>COMP2_FILC</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000007ff</resetMask>
                    <fields>
                        <field>
                            <name>FILEN</name>
                            <description>FILEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SAMPW</name>
                            <description>SAMPW</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP2_FILP</name>
                    <displayName>COMP2_FILP</displayName>
                    <description>COMP2_FILP</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CLKPSC</name>
                            <description>CLKPSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP2_OSEL</name>
                    <displayName>COMP2_OSEL</displayName>
                    <description>COMP2_OSEL</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>CMP2XO</name>
                            <description>CMP2XO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_VREFSCL</name>
                    <displayName>COMP_VREFSCL</displayName>
                    <description>COMP_VREFSCL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003fff</resetMask>
                    <fields>
                        <field>
                            <name>VV1EN</name>
                            <description>VV1EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VV1TRM</name>
                            <description>VV1TRM</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>VV2EN</name>
                            <description>VV2EN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VV2TRM</name>
                            <description>VV2TRM</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_TEST</name>
                    <displayName>COMP_TEST</displayName>
                    <description>COMP_TEST</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_INTSTS</name>
                    <displayName>COMP_INTSTS</displayName>
                    <description>COMP_INTSTS</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>CMP1IS</name>
                            <description>CMP1IS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP2IS</name>
                            <description>CMP2IS</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
