ExponentialDeepSpace/KiCon2023Asia-Badge/fw/svd/N32L406_with_core.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOB</name>
            <baseAddress>0x40010C00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOC</name>
            <baseAddress>0x40011000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOD</name>
            <baseAddress>0x40011400</baseAddress>
        </peripheral>

        <peripheral>
            <name>AFIO</name>
            <description>Alternate function I/O</description>
            <groupName>AFIO</groupName>
            <baseAddress>0x40010000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>AFIO_RMP_CFG</name>
                    <displayName>AFIO_RMP_CFG</displayName>
                    <description>AFIO_RMP_CFG</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>EXTI_ETRR</name>
                            <description>EXTI_ETRR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI_ETRJ</name>
                            <description>EXTI_ETRJ</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADC_ETRR</name>
                            <description>ADC_ETRR</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC_ETRJ</name>
                            <description>ADC_ETRJ</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI2_NSS</name>
                            <description>SPI2_NSS</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI1_NSS</name>
                            <description>SPI1_NSS</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EXTI_CFG1</name>
                    <displayName>AFIO_EXTI_CFG1</displayName>
                    <description>AFIO_EXTI_CFG1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003333</resetMask>
                    <fields>
                        <field>
                            <name>EXTI0_CFG</name>
                            <description>EXTI0_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI1_CFG</name>
                            <description>EXTI1_CFG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI2_CFG</name>
                            <description>EXTI2_CFG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI3_CFG</name>
                            <description>EXTI3_CFG</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EXTI_CFG2</name>
                    <displayName>AFIO_EXTI_CFG2</displayName>
                    <description>AFIO_EXTI_CFG2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003333</resetMask>
                    <fields>
                        <field>
                            <name>EXTI4_CFG</name>
                            <description>EXTI4_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI5_CFG</name>
                            <description>EXTI5_CFG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI6_CFG</name>
                            <description>EXTI6_CFG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI7_CFG</name>
                            <description>EXTI7_CFG</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EXTI_CFG3</name>
                    <displayName>AFIO_EXTI_CFG3</displayName>
                    <description>AFIO_EXTI_CFG3</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003333</resetMask>
                    <fields>
                        <field>
                            <name>EXTI8_CFG</name>
                            <description>EXTI8_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI9_CFG</name>
                            <description>EXTI9_CFG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI10_CFG</name>
                            <description>EXTI10_CFG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI11_CFG</name>
                            <description>EXTI11_CFG</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EXTI_CFG4</name>
                    <displayName>AFIO_EXTI_CFG4</displayName>
                    <description>AFIO_EXTI_CFG4</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003333</resetMask>
                    <fields>
                        <field>
                            <name>EXTI12_CFG</name>
                            <description>EXTI12_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI13_CFG</name>
                            <description>EXTI13_CFG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI14_CFG</name>
                            <description>EXTI14_CFG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXTI15_CFG</name>
                            <description>EXTI15_CFG</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
